<template>
	<view class="p_20">
		<view class="text_c size_38 line_80 bold">用户服务协议</view>
		<view class="">
			长沙市起名信息科技有限公司（下称长沙起名信息科技）在此特别提醒用户认真阅读、充分理解本《服务协议》（下称《协议》）中各条款，包括免除或者限制起名网开发的"起名网"公众号应用责任的免责条款及对用户的权利限制条款。请你审慎阅读并选择接受或不接受本《协议》。除非你接受本《协议》，否则你无权使用本协议所涉相关服务。你对"起名网"使用的行为将视为对本《协议》的接受，并同意接受本《协议》各项条款的约束。
		</view>	
		<view class="">
		本《协议》是你（下称用户）与起名网之间关于用户使用"起名网"移动应用服务所订立的协议，本协议描述"起名网"移动应用与用户之间关于服务相关方面的权利义务。"用户"指使用本服务的个人或组织。
		</view>
		<view class="size_32 bold">一、 使用规则</view>
		<view class="">1、账户信息规则 用户充分了解并同意，起名网为长沙起名信息科技有限公司开发的线上信息服务平台。"起名网"移动应用仅为用户提供信息交流、资讯服务、传播及获取平台，账户登录信息皆来自腾讯微信公众平台，用户必须为自己在微信公众平台注册帐户下的一切行为负责，包括你所上传、编辑的任何内容以及由此产生的任何结果。用户应对"起名网"移动应用中的内容自行加以判断，并承担因使用内容而引发的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。起名网无法且不会对因用户行为而导致的任何损失或损害承担责任。</view>
		<view class="">2、用户个人信息规则 用户充分了解并同意，"起名网"移动应用是一个信息分享、咨询服务、传播及获取的平台，用户通过"起名网"移动应用填写的信息为自愿上传的信息，长沙起名信息科技有义务维护用户上传、编辑的任何信息的私密性。其它第三方均无法通过"起名网"移动应用获取用户发表的信息，用户对任何信息的发表即认可该信息为自愿上传信息，并单独对此行为承担法律责任。</view>
		<view class="">3、发布规则：用户在"起名网"移动应用服务中或通过"起名网"移动应用服务所发布的任何内容并不反映起名信息科技的观点或政策，起名信息科技对此不承担任何责任。</view>
		<view class="">4、变更规则：长沙起名信息科技保留因业务发展需要，单方面对本服务的全部或者部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销"起名网"移动应用服务的权力，用户需承担此风险。</view>
		<view class="">5、知识产权声明：长沙起名信息科技在本服务中提供的服务内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归长沙起名信息科技所有。长沙起名信息科技在本服务中所使用的“起名网”、“易”商标，其著作权或商标归长沙起名信息科技所有。</view>
		<view class="">6、用户违法违规行为</view>
		<view class="">（1） 反对宪法所确定的基本原则的；</view>
		<view class="">（2） 危害国家安全，泄露国家秘密，颠覆国家政权、破坏国家统一的；</view>
		<p>（3） 损害国家荣誉和利益的；</p> 
		<p>（4） 煽动民族仇恨、民族歧视，破坏民族团结的；</p> 
		<p>（5） 破坏国家宗教政策，宣言邪教和封建迷信的；</p> 
		<p>（6） 散布谣言，扰乱社会持续，破坏社会稳定的；</p> 
		<p>（7） 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p> 
		<p>（8） 侮辱或者诽谤他人，侵害他人合法权益的；</p> 
		<p>（9） 含有法律、行政法规禁止的其它内容的信息。</p> 
		<p>如果你发现任何人违反上述规定或以不当的方式使用"起名网"移动应用服务，不得传播并请立即联系长沙起名信息科技公司。</p> 
		<p>7、起名信息科技可依其合理判断，对违反有关法律法规或本协议约定，或侵犯、妨害、威胁任何人权利或安全的内容，长沙起名信息科技有权依法停止传输任何前述内容，并且有权依其自行判断为违反本条款的任何人士采取适当的法律行动，包括但不限于从"起名网"移动应用中删除具有违法性、侵权性、不当性等内容，终止违反者的成员资格，阻止其使用"起名网"移动应用全部或部分服务，并且依据法律法规保存有关信息并向有关部门报告等。</p> 
		<h4>二、 隐私保护</h4> 
		<p>1、尊重用户个人隐私信息的私有性是长沙起名信息科技的一贯制度，长沙起名信息科技将通过技术手段、强化内部管理等办法充分保护用户的个人隐私信息。</p> 
		<p>2、除法律或有法律赋予权限的政府部门要求或事先得到用户明确授权等原因外，长沙起名信息科技保证不对外公开或向第三方透露用户个人隐私信息， 或用户在使用服务时存储的非公开内容。</p> 
		<p>3、同时，为了运营和改善技术与服务， 本服务将可能会自行收集使用或向第三方提供用户的非个人隐私信息，这将有助于长沙起名信息科技向用户提供更好的用户体验和服务质量。</p> <p>4、长沙起名信息科技注重用户的个人隐私的保护。我们需要你登陆微信号才能为你提供你请求的服务，本隐私权声明解释了这一情况下的数据收集和使用情况。本隐私权声明适用于"起名网"移动应用的所有相关服务。</p> 
		<h4>三、免责声明</h4> 
		<p>就下列相关事宜的发生，长沙起名信息科技不承担任何法律责任：</p> 
		<p>1、长沙起名信息科技根据法律规定或相关政府的要求提供你的个人信息；</p> 
		<p>2、由于你将自身敏感信息告知他人或与他人共享，由此导致的任何个人信息的泄漏，或其它非因"起名网"移动应用原因导致的个人信息的泄漏；</p> <p>3、"起名网"移动应用中账户信息皆来自微信官方，用户使用账户信息所引发的所有风险；</p> <p>4、任何由于黑客攻击、电脑病毒侵入或政府管制而造成的暂时性关闭；</p> 
		<p>5、因不可抗力导致的任何后果；</p> 
		<h4>四、其它条款</h4> 
		<p>协议的解释、变更与终止在适用法律允许的范围内，长沙起名信息科技保留对本协议任何条款的解释权和随时变更的权利。可能会随时根据需要修改本协议的任一条款。如发生此类变更，我司会提供新版本的最终用户协议。用户在变更后对本产品的使用将视为已接受变更后的协议条款。</p> 
		<p class="text_c">长沙起名信息科技有限公司</p>
	</view>

</template>

<script>
</script>

<style>
</style>
