<template>
	<view class="">
		<view class="" v-for="(item,i) in arrList" :key="i">
			<view class="dis_flex align_c just_b p_40 p_l20 p_r20 b_b1" @click="item.bool=!item.bool">
				<view class="dis_flex">
					<view class="">{{item.quest}}</view>
				</view>
				<view class=""><text class="iconfont " :class="item.bool?'iconup':'icondown'"></text></view>
			</view>
			<view class="bg_f1 p_20" v-show="item.bool">
				{{item.answer}}
			</view>			
		</view>

	</view>
</template>

<script>
	export default {
		data() {
			return {
				arrList:[{
					quest:'起名网是如何为宝宝起名的？',
					answer: '起名网有智能起名和大师起名两种，智能起名：系统根据客户提供的生辰八字然后生成的名字；大师起名：是起名网的专家团队以及林大师亲自手工起，根据传统和现代的结合，多方面考虑进行起名。',
					bool:false
				},
				{
					quest:'什么是真太阳时间，如何根据真太阳时起名？',
					answer: '真太阳时是根据宝宝出生当地的经纬度偏差以及平太阳时（北京时间）得来。因为我们日常生活中所用的时间为北京时间，是标准时区的平均太阳时。起名网专业起名时会按照出生地点，先根据出当地平太阳时推算出真太阳时，再以真太阳时为准进行起名，而不是直接采用北京时间，因为这样有可能会因时间偏差弄错时辰。',
					bool:false
				},
				{
					quest:'智能起名/大师起名/公司起名怎么收费?',
					answer: '智能起名：有三个收费，分别为：39元100个名字，68元200个名字，88元300个名字。大师起名：有四个收费，分别为：时尚型398元，3+1（推荐名字）。吉祥型598元，4+1（推荐名字），财富型898元，5+1（推荐名字）；富贵型1898元，7+1（推荐名字）。备注：推荐名字为大师个人主观推荐；公司起名：有三个收费，分别为：88元100个名字，138元200个名字，188元300个名字。',
					bool:false
				},
				{
					quest:'如何查询自己提交的订单？',
					answer: '可以关注起名网的微信公众号（搜索baziqiming或起名取名网），公众号内有订单查询功能，直接选择对应的订单查询，输入订单编号，即可查询到订单。温馨提示：不是在起名网提交的订单，付款金额以及商户名称与起名网官网不一致，这种情况下起名网无法为用户查询订单，起名网的收款商户全称是：长沙起名信息科技有限公司。',
					bool:false
				},
				{
					quest:'智能起名/大师起名/公司起名付款后多久可以看名字？',
					answer: '智能起名订单：在付款后即可跳转到订单页面查看名字，同时也可以通过小程序个人中心查看相关名字详情。大师起名订单：需要三个正常工作日起好名字，名字起好后会第一时间会发送短信通知以及邮件。公司起名订单：在付款后即可跳转到订单页面查看名字，同时会在付款五分钟内会发送一条短信通知，短信内有订单号以及专属起名地址链接，直接点击短信内的链接地址即可进入订单页面查看名字。',
					bool:false
				},
				{
					quest:'付款后发现订单内信息填错，如何修改订单？',
					answer: '如在付款后发现订单内填写的信息有误，直接电话联系客服，告知订单内填写的订单编号/手机号码/及正确的出生时间，客服修改后会及时告知。正常工作日可直接联系在线的微信公众号客服、QQ客服。',
					bool:false
				},
				{
					quest:'起名网与其它网站起名系统的区别？',
					answer: '其一：首创多维智能起名，真正以生辰八字和音形义为基准，结合三才五格数理，周易卦象，生肖喜忌，古典诗词成语而来的综合智能起名，非其它网站的单一八字起名和简单的三才五格系统。其二：起名网是全国最大的起名行业网站，名字基于大数据分析起名用字趋势，名字流行度分析，避免太热重名的名字和老旧过时的名字。其三：名字基于起名网十年经验积累研发，更系统、精准、专业。',
					bool:false
				},
				{
					quest:'宝宝八字的五行，是缺什么就补什么吗？',
					answer: '不是。这个是需要区别对待，精确分析，真正做到“需要什么，则补什么”。否则就是简单加减，补救容易失误。',
					bool:false
				},
				{
					quest:'名字的笔画五格评分越高越好吗？',
					answer: '这不是绝对性的。好名字首要考虑八字五行是否补救、音形义好不好，然后再参考笔画五格评分。比如李很猪，五格评分好，分数高，但名字有歧义，只有最适合孩子的名字方能算好名字。',
					bool:false
				},
				{
					quest:'备选名考虑生肖部首宜忌吗？',
					answer: '生肖一般对应生辰八字中的年份，相当于是根据宝宝出生年的干支来看的，比较片面，准确度并不高。而八字起名，是以年、月、日、时来综合考虑的，所以起名结果更具整体性。',
					bool:false
				}]
			}
		}
	}
</script>

<style lang="scss" scoped>
	.iconfont {
		font-size: 38upx;
		color: #999;
	}

	.menu-item {
		display: flex;
		height: 90upx;
		width: 100%;
		align-items: center;
		justify-content: space-between;
		border-bottom: 1px solid #f8f8f8;
		padding: 0 20upx;
	}
</style>
